OF_Sims/SIMPLE/Simple_FAST_RANS_cylinder/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    down
    {
        type            symmetryPlane;
    }

    right
    {
        type            inletOutlet;
        inletValue      uniform 1;
        value           uniform 1;
        
    }

    up
    {
        type            zeroGradient;
    }

    left
    {
        type            turbulentMixingLengthDissipationRateInlet;
        mixingLength    0.005;
        value           uniform 1;
    }

    cylinder
    {
        type            epsilonWallFunction;
        value           uniform 0.1;
    }

    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
